Prit4747/IOT_HUB/sdkconfig.defaults
# ESP32-S3 IoT Hub -- configurable modem backend (SimCom A7672S/USB,
# Quectel EC200U-CN/UART, Quectel EC200U-CN/USB) + Full/Delta HTTPS OTA.
#
# These are the settings common to ALL THREE backends, merged from the
# three source projects (USB Modem / Quectel_EC200U / Quectel_EC200U_USB),
# which turned out to be identical apart from one USB-Host-only line (kept
# here unconditionally -- it only takes effect if USB host code actually
# runs, so it's harmless when the UART backend is selected).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# lwIP PPP (required by both esp_modem and iot_usbh_modem)
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_NOTIFY_PHASE_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
CONFIG_LWIP_PPP_CHAP_SUPPORT=y
CONFIG_LWIP_PPP_MPPE_SUPPORT=n
CONFIG_LWIP_PPP_ENABLE_IPV6=n
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
CONFIG_LWIP_MAX_SOCKETS=16

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=64
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# HTTPS client over PPP
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# USB Host (ESP32-S3 OTG) -- only exercised when a USB backend
# (SimCom A7672S or Quectel EC200U/USB) is selected in menuconfig.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
